Revit 2017 API
StructuralSectionCProfileWithLips Class
 Defines parameters for C Profile with lips structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
public class StructuralSectionCProfileWithLips : StructuralSectionColdFormed
Visual Basic
Public Class StructuralSectionCProfileWithLips _
	Inherits StructuralSectionColdFormed
Visual C++
public ref class StructuralSectionCProfileWithLips : public StructuralSectionColdFormed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfileWithLips
See Also
StructuralSectionCProfileWithLips Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace